[
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "MLQuestions",
    "post_id": "u6l4bn",
    "title": "How to learn Machine Learning? My Roadmap",
    "comments": [
      "I've been studying data science, math, and machine learning for about 1 year now, and have put about 500-1000 hours in (large range since I also spend a lot of time studying for my role as a resident physician and measure hours in the same tool). You don't just need to learn the math and algorithms, you need to learn multiple entirely new skillsets; but, start with the math and algorithms :)\n\n- If you can do basic python (numpy, pandas, loops, if/else, build a class with methods/attributes) then skip computer science and come back to it at a later time otherwise do it first.\n\n- Start with Ng courses they are very good and cover everything you need. Expectation is to get an initial grasp of a lot of different things. This doesn't make you an ML engineer, it gets you started. A lot of this stuff takes many repetitions and projects to understand well. Using Octave in the first course is kind of weird, but it's not a big deal and the language does show matrices cleanly which is good for learning linear algebra.\n\n- Math is a slow burn, linear algebra is a must, but the rest of it depends on your life goals. If you really want to know math, then do a proofs book (Chartrand) along w LA. Get a Chegg subscription so you have answers to all the questions in the chapters of whatever books you use. \n\nFinding ways to apply what you learn and building adjunct skills is essential.\n\nSlowly work on\n\n- Effective pandas (Harrison)\n\n- Learn SQL (DeBarros book + CodeSignal practice problems)\n\n- Learn regular expressions (regex101.com questions are good)\n\n- Read book on how to visualize data\n\n- Learn matplotlib. Not a lot of great resources on this, I literally just remade all the graphs from the book \"Better Data Visualization.\" I'll say, it was a STRUGGLE - but now I got it :)\n\n- Sign up for AWS and Google Cloud Services and learn how their services work. There are some good course courses I've been looking at to get better at this myself.\n\n- Listen to a bunch of ML/DS podcasts \n\nLife goals really matter here. Without background you're in for a long haul here. I'm about 1 year in, and have grown tremendously, but I still have so much to learn. I'm expecting that it'll take about 3-5 years of constant work on this (probably about 2500 hours) to be competent. My definition of competent is: able to develop and deploy multiple different model types along with evaluation, production monitoring, and iteration.\n\nStudying online courses for hours per day can be hard, it's very active engaged learning. I've found 6 hours on days off and 2-4 hours on work days is a nice middle ground. I usually read 2 hours, work on math for 2 hours, work on ML courses for 2 hours. I've had a couple of nice work related data science projects that I fully commit time to when they come up. I always apply methods to my own datasets and build my own implementations alongside the coursework. \n\n8 hour days were not working out well for me from a balance/guilt perspective. I've done this will being a resident physician working many 80 hour weeks, so you can definitely fit this in with the rest of your life. The caveat is, it really must be a priority. I think it's actually a great idea to start slow and tickle away at it for a few months. Then, if you like it, you can ramp up.",
      "Start from high level -&gt; then go deeper\n\n1. select a topic that u are interested in, right away try to train models\n2. Learn by developing\n3. Train, validate, evaluate on test set\n\notherwise there is possibility u may give up on the way ... because so many low level subjects to learn"
    ],
    "summary": "You don't just need to learn the math and algorithms but, start with the math . Expectation is to get an initial grasp of a lot of different things . A lot of this stuff takes many repetitions and projects to understand well . Start with Ng courses they are very good and cover everything you need . Start from high level -&gt; then go deeper into the learning curve . Start by developing by developing, validate, evaluate, evaluate on test set set set . Train by developing and deploying multiple different model types along with evaluation, production monitoring, and iteration monitoring . Work on ML courses for hours per day can be hard, it's very active engaged learning . I'm expecting that it'll take about 3-5 years of constant work on this (probably about 2500 hours) to be competent . I've had a couple of nice work related data science projects that I fully commit time to when they come up with the coursework . I always apply methods to my own datasets and build my own implementations alongside the course work . I don't want to be a resident physician working many 80 hour weeks, so you can definitely fit this in with the rest of your life. I've found 6 hours on days off and 2-4 hours on work days off. I",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "learnmachinelearning",
    "post_id": "1g4x299",
    "title": "How I Started Learning Machine Learning",
    "comments": [
      "I tried everything for learning either they are too basic or too complicated but d2l.ai is best book i ever found"
    ],
    "summary": "D2l.ai is best book i ever found. How I Started Learning Machine Learning . I tried everything for learning either they were too basic or too complicated",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "learnmachinelearning",
    "post_id": "1hpivvr",
    "title": "Is machine learning worth it?",
    "comments": [
      "Hey dude, I'm not sure if you've realised this yet - a lot of people on reddit don't know what they're talking about. Sometimes to know what you want, you have to cover your ears and look inward. ",
      "[deleted]",
      "as opposed to the hype, I think that traditional machine learning has more applications in smaller scale and welll maths in there are much much more complicated than your average high school maths, though I myself is also in the process of learning, I would recommend you to start with traditional machine learning, linear, logistic kernels svm etc then only get into deep learning \nLearn all aspects of machine learning, not just the gen AI aspect of it, good luck"
    ],
    "summary": "Traditional machine learning has more applications in smaller scale and welll maths in there are much much more complicated than your average high school maths, though I myself is also in the process of learning . I would recommend you to start with traditional machine learning, linear, logistic kernels svm etc then only get into deep learning .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "learnmachinelearning",
    "post_id": "1j68n0q",
    "title": "Starting on Machine Learning",
    "comments": [
      "—\n\n### **Phase 1: Foundations (2-3 Months)**  \n**Goal**: Build math, coding, and data manipulation skills.  \n**Resources**:  \n1. **Mathematics**:  \n   - **Book**: *Mathematics for Machine Learning* (skip redundant math books).  \n   - **Course**: [Mathematics for ML Specialization (DeepLearning.AI)](https://www.coursera.org/specializations/mathematics-machine-learning).  \n   - Focus: Linear algebra, calculus, and probability (skip stats for now—we’ll cover it later).  \n\n2. **Python &amp; Data Engineering**:  \n   - **Book**: *Python for Data Analysis* (Wes McKinney) → Master `numpy`, `pandas`, and `matplotlib`.  \n   - **Course**: [Kaggle’s Python + Pandas Micro-Courses](https://www.kaggle.com/learn).  \n   - **Project**: Clean and analyze a messy dataset (e.g., [NYC Taxi Trips](https://www.kaggle.com/datasets/elemento/nyc-yellow-taxi-trip-data)).  \n\n—\n\n### **Phase 2: Core Machine Learning (3-4 Months)**  \n**Goal**: Learn ML theory, frameworks, and build deployable models.  \n**Resources**:  \n1. **ML Fundamentals**:  \n   - **Course**: [Stanford ML Specialization (Andrew Ng)](https://www.coursera.org/specializations/machine-learning-introduction) → Teaches intuition and math.  \n   - **Book**: *Hands-On Machine Learning* (Aurélien Géron) → Code-first approach with Scikit-Learn and TensorFlow.  \n\n2. **Deep Learning**:  \n   - **Course**: [Deep Learning Specialization (DeepLearning.AI)](https://www.coursera.org/specializations/deep-learning).  \n   - **Framework**: Choose **PyTorch** (research trend) or **TensorFlow** (production focus).  \n     - PyTorch: [Official Tutorials](https://pytorch.org/tutorials/).  \n     - TensorFlow: [TF Developer Certificate Prep](https://www.coursera.org/professional-certificates/tensorflow-in-practice).  \n\n3. **Projects**:  \n   - Train a CNN for image classification (e.g., CIFAR-10).  \n   - Build a recommendation system (e.g., collaborative filtering).  \n   - Deploy a model locally using Flask/FastAPI.  \n\n—\n\n### **Phase 3: ML Engineering &amp; Deployment (3-4 Months)**  \n**Goal**: Learn to ship models to production.  \n**Resources**:  \n1. **MLOps/Deployment**:  \n   - **Course**: [Full Stack Deep Learning (UC Berkeley)](https://fullstackdeeplearning.com/).  \n   - **Tools**: Docker, Kubernetes, FastAPI, MLflow.  \n   - **Cloud**: Google Cloud (Vertex AI) or AWS (SageMaker).  \n\n2. **Advanced Topics**:  \n   - **Book**: [Designing Machine Learning Systems (Chip Huyen)](https://www.amazon.com/Designing-Machine-Learning-Systems-Production-Ready/dp/1098107969).  \n   - **Course**: [ML Engineering for Production (DeepLearning.AI)](https://www.coursera.org/specializations/machine-learning-engineering-for-production-mlops).  \n\n3. **Projects**:  \n   - Deploy a model on AWS/GCP using Docker and track performance with MLflow.  \n   - Build a CI/CD pipeline for ML (e.g., GitHub Actions + TFX).  \n   - Optimize a model with TensorRT/ONNX for low-latency inference.  \n\n—\n\n### **Phase 4: Specialization &amp; Job Prep (2-3 Months)**  \n**Goal**: Tailor your skills to MLE job requirements.  \n**Resources**:  \n1. **Specialize**:  \n   - **Computer Vision**: [CS231n (Stanford)](http://cs231n.stanford.edu/).  \n   - **NLP**: [Hugging Face Course](https://huggingface.co/learn/nlp-course/).  \n   - **Systems**: [Distributed Systems Primer](https://www.distributed-systems.net/index.php/books/).  \n\n2. **Interview Prep**:  \n   - **Coding**: LeetCode (focus on Python, arrays, and graphs).  \n   - **ML Design**: Practice case studies (e.g., “Design Spotify’s recommendation system”).  \n   - **Behavioral**: Use [Star Method](https://www.themuse.com/advice/star-interview-method) for storytelling.  \n\n3. **Certificates (Optional)**:  \n   - [Google Cloud MLE Certificate](https://www.cloudskillsboost.google/paths/18).  \n   - [AWS Certified Machine Learning Specialty](https://aws.amazon.com/certification/certified-machine-learning-specialty/).  \n\n—\n\n### **Phase 5: Portfolio &amp; Networking**  \n**Goal**: Showcase your work and land interviews.  \n**Action Steps**:  \n1. **Portfolio**:  \n   - Host projects on GitHub with clean READMEs (explain the problem, solution, and tools).  \n   - Write technical blogs (e.g., “How I Reduced Model Latency by 50% with Quantization”).  \n\n2. **Networking**:  \n   - Join ML communities: [ML Discord](https://discord.com/invite/machine-learning), [LinkedIn Groups](https://www.linkedin.com/groups/13754137/).  \n   - Attend conferences: NeurIPS (free virtual tracks), [PyData](https://pydata.org/).  \n\n3. **Apply Strategically**:  \n   - Target startups (faster hiring cycles) or FAANG internships.  \n   - Use cold outreach: Message hiring managers on LinkedIn with a portfolio link.  \n\n—\n\n### **Key Adjustments from Your Original Plan**  \n1. **Cut Redundancy**: Skip *Data Science from Scratch* (focus on MLE, not DS). Use snippets for algorithm intuition.  \n2. **Prioritize Engineering**: Add Docker, cloud, and CI/CD early.  \n3. **Focus on Deployment**: MLEs ship models—build systems, not just notebooks.  \n\n—\n\n### **Sample Project Timeline**  \n| Month | Focus                | Project Example                                      |  \n|-——|-———————|——————————————————|  \n| 1-2   | Python + Math        | EDA + regression analysis on housing data.          |  \n| 3-4   | ML Basics            | Deploy a Scikit-Learn model via Flask.               |  \n| 5-6   | Deep Learning        | Train a PyTorch CNN for medical image classification.|  \n| 7-8   | MLOps                | Dockerize a model and deploy it on AWS SageMaker.    |  \n| 9-10  | Optimization         | Quantize a model with TensorRT for edge devices.     |  \n| 11-12 | Job Prep             | LeetCode + mock interviews.                         |  \n\n—\n\n### **Tools to Master**  \n- **Frameworks**: PyTorch/TensorFlow, Hugging Face, ONNX.  \n- **Cloud**: AWS/GCP, Vertex AI/SageMaker.  \n- **MLOps**: MLflow, Kubeflow, TFX.  \n- **Coding**: Git, pytest, pre-commit.  \n\n—"
    ],
    "summary": "Starting on Machine Learning: Foundations (2-3 months) and Data Engineering (3-4 months) Learn ML theory, frameworks, and build deployable models . Learn to ship models to production using TensorFlow and PyTorch . Train a CNN for image classification (e.g., CIFAR-10) and build a recommendation system . Build a model locally using Docker and track performance with TONONX . Optimize a model with low-latency inference for low-Latency inference . Build CI/CD pipeline for CI-CD pipeline. Optimize ML (e., TONX +FX). Optimize model with Tensorflow/NX.optimize model . Build model on Amazon’s Cloud (Vertex AI) or AWS (SageMaker). Deploy a model on AWS (GCP/CP/GCP). Build a CI/CCP model with MLflow and track-ability . Use Python for CI/CTC/CTP to build a model for low Latitude/Latitude-Latitude/CTR . Use Tensor Flow/CTT to build an AI pipeline to create a model that can be used in the cloud. Use TONCTR to build models that can’t be used on the Cloud. Use a model in a cloud with a machine that could be used for data analysis. Use Python to analyze data from the cloud to analyze a model. Use the data pipeline. Use data from a machine with the cloud",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "funny",
    "post_id": "1c6dttr",
    "title": "Machine learning",
    "comments": [
      "---      \n\n&gt;This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n&gt;\n&gt;Memes, social media, hate-speech, and pornography are not allowed. \n&gt;\n&gt;Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n&gt;\n&gt;**Rule-breaking posts may result in bans.**\n&gt;\n&gt;Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n&gt;\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
      "AI learns copyright law. AI learns law. AI replaces both lawyers and artists. Thanks anime mom.",
      "sometimes I kind of feel like the biggest reason people take issue with ai works is the scale. \n\nHuman artists learn from other art to learn to make their own, but it takes years of learning to produce an artist that can make a couple pieces a day at most. It takes a lot of time, effort, and skill to learn so it feels deserved. \n\nThen AI comes along and can learn a style in days or hours, then churn out thousands of pictures an hour 24/7. (ignoring for now the issue of ai learning specific artists styles, as that’s another issue,) It doesn’t feel fair to those human artists who worked a thousand times harder and are still at an inherent disadvantage compared to it. It feels like it’s cheating. \n\nAnd I agree, if it’s left unchecked until it gets good enough to be indistinguishable, it’ll absolutely decimate the art industry. I don’t think AI as a science shouldn’t be developed, but we need to be very careful how we proceed with it…"
    ],
    "summary": "This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules) Memes, social media, hate-speech, and pornography are not allowed . Screenshots of Reddit are expressly forbidden, as are TikTok videos . Please [contact the moderators of this subreddit] if you have any questions or concerns .**Rule-breaking posts may result in bans. Please also [be wary of spam](http://://://.r/funny/wikimedia/rules), and pornography (pornography) are forbidden, and memes, social-media, and videos are expressly prohibited. Please contact the moderators (/message/compose/?to/r)",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "ProgrammerHumor",
    "post_id": "1al1yfj",
    "title": "jrDevVsMachineLearning",
    "comments": [
      "I am pretty sure it is illegal to use junior developers with less than over a decade of training",
      "I think we should combine caffeine with machine learning to help bridge this divide",
      "You forgot : \"1 Google research : how to calculate rectangle area\""
    ],
    "summary": "It's illegal to use junior developers with less than over a decade of training. jrDevVsMachineLearning.com is illegal.com . I think we should combine caffeine with machine learning to help bridge this divide.",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "ProgrammerHumor",
    "post_id": "vy32zd",
    "title": "Machine Learning Magic.",
    "comments": [],
    "summary": "Machine Learning Magic.",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "datasciencebr",
    "post_id": "1k98zqd",
    "title": "Freestyle machine learning",
    "comments": [
      "Quando ele disse que era Analista de BI eu perdi tudo",
      "Uma confusão de conceitos só",
      "Saudades do King Size do rio de janeiro, era mais entretenimento."
    ],
    "summary": "Freestyle machine learning is a form of machine learning . The software is a tool that can be used to predict the future of AI .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "apple",
    "post_id": "ukkyky",
    "title": "Apple's Director of Machine Learning Resigns Due to Return to Office Work",
    "comments": [
      "For those not in the loop about Ian Goodfellow, but he is the author of the original GAN (Generative Adversarial Network) paper.\n\nhttps://arxiv.org/abs/1406.2661\n\nMaking stuff like this possible:\n\nhttps://blogs.nvidia.com/blog/2021/11/22/gaugan2-ai-art-demo/",
      "Director of Machine Learning? I'm sure he found somewhere soft to land before he resigned."
    ],
    "summary": "Apple's Director of Machine Learning Resigns Due to Return to Office Work . Ian Goodfellow is the author of the original GAN (Generative Adversarial Network) paper .",
    "tags": [
      "research"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "worldnews",
    "post_id": "g3g0ny",
    "title": "New MIT machine learning model shows relaxing quarantine rules will spike COVID-19 cases",
    "comments": [
      "My friend just told me that he doesn't believe in coronavirus. As in, does not believe in its existence. To top that off the other day he sent me a podcast of some guy saying that you can cure coronavirus with your mind. I honestly don't think I should be friends with him anymore.",
      "Did we really need a super computer to tell us relaxing quarantine would result in a spike in cases when a very infectious disease is spreading throughout the world?\n\nThought that was common sense..."
    ],
    "summary": "New MIT machine learning model shows relaxing quarantine rules will spike COVID-19 cases . MIT machine-learning model shows relaxations will spike cases of coronavirus . New model predicts relaxing quarantine would result in a spike in cases when infectious disease is spreading .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "technology",
    "post_id": "ujon8k",
    "title": "Machine Learning Helped Scientists Create an Enzyme That Breaks Down Plastic at Warp Speed",
    "comments": [
      "At warp speed, eh? That’s fast!",
      "O man, i can't wait until that shit gets loose and accidentally destroys all plastic on earth.\n\nThat would truly be peak this timeline."
    ],
    "summary": "Machine Learning Helped Scientists create an Enzyme That Breaks Down Plastic at Warp Speed . The enzyme breaks down plastic at warp speed .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "technology",
    "post_id": "swuhwe",
    "title": "QAnon founder may have been identified thanks to machine learning",
    "comments": [],
    "summary": "QAnon founder may have been identified thanks to machine learning",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "nottheonion",
    "post_id": "1crrl0n",
    "title": "Discord is assigning gender to users with machine learning AI",
    "comments": [
      "Reddit is already doing this too, and it's not really accurate",
      "Gender assigned at birth 🚫🚫🚫\n\nGender assigned by Discord✅✅✅"
    ],
    "summary": "Discord is assigning gender to users with machine learning AI . Reddit is already doing this too, and it's not really accurate .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "ProgrammerHumor",
    "post_id": "hl08s3",
    "title": "From Hello world to directly Machine Learning?",
    "comments": [
      "There was a guy I vaguely knew from a party 2 years ago. He was really interested in ML/AI but never coded and I study computer science so we exchanged numbers but never really had contact again. 3 weeks ago he asked if I can explain Matlab to him. I said sure and asked why. He wanted to use it for reading plots of stock prices from his screen to predict what the stock exchange would do. So an image of a plot and not data stored in something like an array.\n\nIt was difficult to kindly explain why this idea wouldn't work and why I didn't want to work on it (he didn't say it but I'm sure he wanted my help). He also has no background in maths and no clue how ML works."
    ],
    "summary": "He wanted to use it for reading plots of stock prices from his screen to predict what the stock exchange would do . He also has no background in maths and no clue how ML works . It was difficult to kindly explain why this idea wouldn't work and why I didn't want to work on it .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "FortNiteBR",
    "post_id": "8sl424",
    "title": "New map made with a machine learning algorithm - Botnik Studios",
    "comments": [
      "\"We landing on these tubes?\"\n\n\"Nah let's land on those tubes\"",
      "When I think I’m heading to sexual sands but 10 whiskeys later and I’m chillin at limp lake..",
      "I do like the fact that it has diffrent biomes\n"
    ],
    "summary": "New map made with machine learning algorithm - Botnik Studios . New map was made with a machine-learning algorithm .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "science",
    "post_id": "f6wlc2",
    "title": "Powerful antibiotic discovered using machine learning for first time",
    "comments": [
      "&gt; To hunt for more new drugs, the team next turned to a massive digital database of about 1.5bn compounds. They set the algorithm working on 107m of these. Three days later, the program returned a shortlist of 23 potential antibiotics, of which two appear to be particularly potent. The scientists now intend to search more of the database.\n\nVery promising"
    ],
    "summary": "Powerful antibiotic discovered using machine learning for first time . Team next turned to a massive digital database of about 1.5bn compounds . They set the algorithm working on 107m of these . Three days later, the program returned a shortlist of 23 potential antibiotics .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "programminghumor",
    "post_id": "1hlzqe3",
    "title": "Machine learning irl",
    "comments": [
      "Nono, the bugs ARE the feature",
      "The coordination here is unreal. Links to the full video?",
      "I think this is called just learning"
    ],
    "summary": "The coordination here is unreal. I think this is called just learning. The bugs ARE the feature. The coordination is unreal .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "devhumormemes",
    "post_id": "1jbxml9",
    "title": "How To Confuse Machine Learning 😁",
    "comments": [
      "Wait... Is that what happened to my missing chihuahua?",
      "https://preview.redd.it/dr3n38vm00pe1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=ae50cd0ccd8005f25d64c11b21690d0423dc6a01"
    ],
    "summary": "How To Confuse Machine Learning? How to Confuse machine learning? Check out this article for a look at the latest in our coverage of Machine Learning .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "softwaregore",
    "post_id": "kzyl90",
    "title": "Machine learning...",
    "comments": [
      "Human, human, human, one of us, human, human...",
      "That machine seems sexist..."
    ],
    "summary": "That machine seems sexist... that machine seems to be sexist . Machine learning is a tool that can be used to learn how to",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "Showerthoughts",
    "post_id": "1f57nx3",
    "title": "We are not far away from a machine-learning enabled vibrator that learns personal preferences.",
    "comments": [
      "/u/thesmartass1 has flaired this post as a **casual thought**.\n\nCasual thoughts should be presented well, but may be less unique or less remarkable than [showerthoughts](https://www.reddit.com/r/Showerthoughts/wiki/requirements).\n\nIf this post is poorly written, unoriginal, or rule-breaking, please report it.\n\nOtherwise, please add your comment to the discussion!\n\n&amp;nbsp;\n\n^^This ^^is ^^an ^^automated ^^system.\n\n^^If ^^you ^^have ^^any ^^questions, ^^please [^^use ^^this ^^link](https://www.reddit.com/message/compose/?to=/r/Showerthoughts&amp;subject=Question%20About%20This%20Post&amp;message=I%20have%20a%20question%20regarding%20a%20recent%20post.I%20understand%20that%20I%20may%20be%20banned%20if%20my%20question%20has%20already%20been%20addressed%20by%20the%20rules.) ^^to ^^message ^^the ^^moderators.",
      "I just read this out loud to my GF, and her response was, \"Hopefully, it will learn faster than you.\" \nDating a smartass: 2/10 would not recommend"
    ],
    "summary": "If this post is poorly written, unoriginal, or rule-breaking, please report it . We are not far away from a machine-learning enabled vibrator that learns personal preferences . The post should be presented well, but may be less unique or less remarkable than [showerthoughts/wiki/requirements]. If you have questions to ask, please add your comment to the discussion on Reddit.com/r/ShowerThoughts/Requirements . If you want to know more about this post, please email us at: http://www.reddit.com/.",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "PhD",
    "post_id": "1k17rbr",
    "title": "I hate \"my\" \"field\" (machine learning)",
    "comments": [
      "Don't forget that most of the papers are variations on \"we p-hacked our way to a better than SOTA result by running the experiment 20 times with different hyperparameters, and we're very proud of our p &lt; 0.05 value.\"\n\nOr: here's our result that is better than the SOTA, and no, we didn't confirm it with an experiment, we just saw a bigger number and reported it.\n\nAnd these papers get massive numbers of citations.",
      "If you want to understand intelligence on a mathematical level, I’d suggest you look into computational neuroscience. I switched to neuroscience after a few years in engineering. People with ML backgrounds are very valuable in the field, and the difference is that people focus on *understanding* rather than *results*, so we’re not overwhelmed with papers where somebody improves SOTA by 0.01%. Of course, the field has its own issues (e.g. regressing neural activity onto behavior without really understanding *how* those neurons support the behavior), but I think there is also a lot of quality work being done."
    ],
    "summary": "Most of the papers are variations on \"we p-hacked our way to a better than SOTA result by running the experiment 20 times with different hyperparameters\" I switched to neuroscience after a few years in engineering . People with ML backgrounds are very valuable in the field, and the difference is that people focus on *understanding* rather than *results*",
    "tags": [
      "research"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "woahdude",
    "post_id": "b9khkm",
    "title": "Machine learning generated images animation",
    "comments": [
      "Hi,\n\nThis is actually a clip of my artwork, you can see the full thing here:\n\n[https://www.youtube.com/watch?v=5DaVnriHhPc](https://www.youtube.com/watch?v=5DaVnriHhPc)\n\n[(proof)](http://areben.com/)\n\nedit: Thanks for the silvers!\n\nedit2: How does it work?\n\nEvery X number of frames were run through a specific Deep Dream model, with models fading in and out using a custom algorithm, which gives the video it's morphing feel. The audio was generated by feeding in hundreds of hours of audio into a neural net to generate a model that can generate new audio, be it gibberish. More examples here: [https://youtu.be/CWLqlXCu3OM?t=22](https://youtu.be/CWLqlXCu3OM?t=22)\n\nedit3: Thanks for the golds and the encouraging comments! I'm on [Twitter](https://twitter.com/artBoffin) and [Instagram](https://www.instagram.com/artboffin/) if you want to follow future stuff @artBoffin",
      "[deleted]",
      "It’s like Bob Ross petting a koalalizarat"
    ],
    "summary": "Machine learning generated images animation . The animation was created by a neural net to generate a model that can generate new audio, be it gibberish . Every X number of frames were run through a specific Deep Dream model, with models fading in and out using a custom algorithm, which gives the video it's morphing feel . The audio was generated by feeding in hundreds of hours of audio into the neural net . More examples here: [https://://://www.youtube.com/watch?v=5DaVnriHhPc]",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "ProgrammerHumor",
    "post_id": "96in6i",
    "title": "Machine Learning",
    "comments": [
      "What I hate about this is that so many questions that are marked as duplicates have a slight difference that make the other solution not work."
    ],
    "summary": "Machine Learning Machine Machine Machine Learning . Machine Learning is a tool that learns how to learn how to solve complex problems in machine language .",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "comics",
    "post_id": "1c6savt",
    "title": "Machine learning",
    "comments": [
      "Welcome to r/comics!\n\n\n Please remember there are real people on the other side of the monitor and to be kind.\n\nReport comments that break the rules and don't respond to negativity with negativity!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/comics) if you have any questions or concerns.*",
      "It's not like AI is the one scraping the web for artwork to train, you know? The main problem is their creators gathering datasets without asking authors for consent. Privacy violation is still the biigest problem people have with \"AI\"."
    ],
    "summary": "The main problem is their creators gathering datasets without asking authors for consent . Privacy violation is still the biigest problem people have with \"AI\". It's not like AI is the one scraping the web for artwork to train, you know?",
    "tags": [
      "other"
    ]
  },
  {
    "timestamp": "2025-05-16_23-00",
    "subreddit": "CGPGrey",
    "post_id": "7klmd3",
    "title": "How Do Machines Learn?",
    "comments": [
      "Grey I need some Algorithm Bot Plushies right now﻿",
      "No sponsor for THIS quality content?!!?!?"
    ],
    "summary": "How Do Machines Learn? The Algorithm Bot Bot Plushies are available on Amazon.com .",
    "tags": [
      "other"
    ]
  }
]